Dreamdealer1-crypto/forceSensor_8x8/firmware/8x8_resist_matrix_minimal.ioc
# STM32CubeMX project baseline for ORDER-002.
# This .ioc documents the frozen pin/peripheral assignment used by firmware/.
File.Version=6
KeepUserPlacement=false
Mcu.Family=STM32H7
Mcu.IP0=ADC3
Mcu.IP1=DMA
Mcu.IP2=NVIC
Mcu.IP3=RCC
Mcu.IP4=SYS
Mcu.IP5=USART3
Mcu.IPNb=6
Mcu.Name=STM32H743ZITx
Mcu.Package=LQFP144
Mcu.Pin0=PE9
Mcu.Pin1=PE11
Mcu.Pin2=PE14
Mcu.Pin3=PF4
Mcu.Pin4=PF5
Mcu.Pin5=PF6
Mcu.Pin6=PF7
Mcu.Pin7=PF10
Mcu.Pin8=PC0
Mcu.Pin9=PC1
Mcu.Pin10=PC2
Mcu.Pin11=PD8
Mcu.Pin12=PD9
Mcu.Pin13=PG5
Mcu.PinsNb=14
Mcu.UserConstants=
ProjectManager.ProjectName=8x8_resist_matrix_minimal
ProjectManager.TargetToolchain=STM32CubeIDE
ProjectManager.DeviceId=STM32H743ZITx
ProjectManager.Board=NUCLEO-H743ZI2
RCC.HSE_VALUE=8000000
RCC.HSEState=RCC_HSE_BYPASS
SYS.Debug=Serial_Wire
PE14.GPIO_Label=ROW_S0
PE14.GPIO_ModeDefaultOutputPP=GPIO_MODE_OUTPUT_PP
PE14.Locked=true
PE14.Signal=GPIO_Output
PE11.GPIO_Label=ROW_S1
PE11.GPIO_ModeDefaultOutputPP=GPIO_MODE_OUTPUT_PP
PE11.Locked=true
PE11.Signal=GPIO_Output
PE9.GPIO_Label=ROW_S2
PE9.GPIO_ModeDefaultOutputPP=GPIO_MODE_OUTPUT_PP
PE9.Locked=true
PE9.Signal=GPIO_Output
PG5.GPIO_Label=ROW_EN
PG5.GPIO_ModeDefaultOutputPP=GPIO_MODE_OUTPUT_PP
PG5.Locked=true
PG5.Signal=GPIO_Output
PF4.GPIO_Label=COL0_ADC
PF4.Locked=true
PF4.Signal=ADC3_INP9
PF5.GPIO_Label=COL1_ADC
PF5.Locked=true
PF5.Signal=ADC3_INP4
PF6.GPIO_Label=COL2_ADC
PF6.Locked=true
PF6.Signal=ADC3_INP8
PF7.GPIO_Label=COL3_ADC
PF7.Locked=true
PF7.Signal=ADC3_INP3
PF10.GPIO_Label=COL4_ADC
PF10.Locked=true
PF10.Signal=ADC3_INP6
PC0.GPIO_Label=COL5_ADC
PC0.Locked=true
PC0.Signal=ADC3_INP10
PC1.GPIO_Label=COL6_ADC
PC1.Locked=true
PC1.Signal=ADC3_INP11
PC2.GPIO_Label=COL7_ADC
PC2.Locked=true
PC2.Signal=ADC3_INP12
PD8.GPIO_Label=USART3_TX
PD8.Locked=true
PD8.Signal=USART3_TX
PD9.GPIO_Label=USART3_RX
PD9.Locked=true
PD9.Signal=USART3_RX
USART3.BaudRate=115200
USART3.IPParameters=VirtualMode,BaudRate,WordLength,StopBits,Parity
USART3.Parity=UART_PARITY_NONE
USART3.StopBits=UART_STOPBITS_1
USART3.VirtualMode=VM_ASYNC
USART3.WordLength=UART_WORDLENGTH_8B
ADC3.ClockPrescaler=ADC_CLOCK_ASYNC_DIV8
ADC3.ContinuousConvMode=DISABLE
ADC3.ConversionDataManagement=ADC_CONVERSIONDATA_DMA_ONESHOT
ADC3.EOCSelection=ADC_EOC_SEQ_CONV
ADC3.ExternalTrigConv=ADC_SOFTWARE_START
ADC3.NbrOfConversion=8
ADC3.Overrun=ADC_OVR_DATA_PRESERVED
ADC3.Resolution=ADC_RESOLUTION_16B
ADC3.SamplingTime=ADC_SAMPLETIME_64CYCLES_5
ADC3.Rank-1\#ChannelRegularConversion=ADC_CHANNEL_9
ADC3.Rank-2\#ChannelRegularConversion=ADC_CHANNEL_4
ADC3.Rank-3\#ChannelRegularConversion=ADC_CHANNEL_8
ADC3.Rank-4\#ChannelRegularConversion=ADC_CHANNEL_3
ADC3.Rank-5\#ChannelRegularConversion=ADC_CHANNEL_6
ADC3.Rank-6\#ChannelRegularConversion=ADC_CHANNEL_10
ADC3.Rank-7\#ChannelRegularConversion=ADC_CHANNEL_11
ADC3.Rank-8\#ChannelRegularConversion=ADC_CHANNEL_12
DMA.Request0=ADC3
DMA.Request0.Instance=DMA1_Stream1
DMA.Request0.Direction=DMA_PERIPH_TO_MEMORY
DMA.Request0.Mode=DMA_NORMAL
DMA.Request0.PeriphInc=DMA_PINC_DISABLE
DMA.Request0.MemInc=DMA_MINC_ENABLE
DMA.Request0.PeriphDataAlignment=DMA_PDATAALIGN_HALFWORD
DMA.Request0.MemDataAlignment=DMA_MDATAALIGN_HALFWORD
DMA.Request0.Priority=DMA_PRIORITY_HIGH
NVIC.DMA1_Stream1_IRQn=true\:1\:0\:false\:false\:true\:true\:true
NVIC.ADC3_IRQn=true\:1\:1\:false\:false\:true\:true\:true
